[{
  "_id": "6326073aa815f437ea07f57a",
  "id": 1,
  "content": " As President of the Sigourney Area Development Corporation (SADC), I want to invite those interested in starting a business in a supportive community to consider Sigourney, “Where Tradition Meets Tomorrow”.  We seek to have a robust community by promoting employment which drives economic growth in the area. Ultimately this assists in providing for a high quality of life both locally and throughout Keokuk County. To strive for this, SADC serves a lead role in industrial, tourism and community development activities."
},{
  "_id": "6326073aa815f437ea07f57b",
  "id": 2,
  "content": "SADC is a forward looking and action-oriented economic development corporation which consists of a part time executive director and administrative assistant, a broad based membership, and a highly committed board of directors. We have five standing committees: Marketing/Industry Development, Revolving Loan Fund, Community Betterment, Membership/Fund-raising/PR and the SADC Executive Committee"
},{
  "_id": "6326073aa815f437ea07f57c",
  "id": 3,
  "content": "We are a proud supporter of our town of 2,200 people, as evidenced by our role in bringing the following businesses and industries to town: Sigourney Foods, Bender Foundry Service, First Resources Corporation, Duro-Last Roofing and Sedna Warehousing. Other projects include the Prairie View Condos, Belva Deer Inn and the Lake Belva Deer project. Through our Revolving Loan Fund Program, we are able to make available startup or expansion funds at low interest rates."
},{
  "_id": "6326073aa815f437ea07f57d",
  "id": 4,
  "content": "For those businesses needing a development site, SADC has 27+ acres available in our industrial park. Low interest loans may be available for qualifying businesses within our Enterprise Zone."
},{
  "_id": "6326073aa815f437ea07f57e",
  "id": 5,
  "content": "SADC has an excellent relationship with both the city and county governments.  In cooperation with the city’s Local Option Sales Tax monies, SADC’s Community Betterment Committee provides assistance to local businesses that apply for the annual grants.  These projects vary from store front paint to new roofs to a new parking lot.  SADC is continually looking for ways to help local retailers improve their services."
},{
  "_id": "6326073aa815f437ea07f57f",
  "id": 6,
  "content": "Rural communities like ours are highly committed to their local businesses. Sigourney has over 200 businesses which receive strong patronage by area residents. Your new business can be confident of similar support."
},{
  "_id": "6326073aa815f437ea07f580",
  "id": 7,
  "content": "Jeff Graff"
},{
  "_id": {
    "$oid": "63260c06a815f437ea07f589"
  },
  "id": 8,
  "content": "President, SADC"
}]